public/httpdocs/app/controllers/application_controller.rb

  def current_admin
    @current_admin ||= Administrator.find_by(id: session[:admin_id]) if session[:admin_id]
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]