public/httpdocs/app/controllers/admin/contacts_controller.rb

SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."created_at" DESC
---
    def index
      @contacts = Contact.all

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
      @contact = Contact.find(params[:id])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "contacts" SET "status" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["status", "read"], ["updated_at", "2025-01-08 11:30:44.182820"], ["id", 4]]
---
    def update
      @contact = Contact.find(params[:id])
      if @contact.update(contact_params)

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 3]]
---
    def destroy
      @contact = Contact.find(params[:id])
      @contact.destroy